Repository: minkphp/Mink
Catalog: src/Behat/Mink/Behat/Context/translations/*.xliff
Languages: cs, de, es, nl, pt, pt_pt

# i-am-on-page
source: /^(?:|I )am on "(?P<page>[^"]+)"$/
cs: /^jsem na(?:| stránce) "(?P<page>[^"]+)"$/
de: /^(?:|ich )bin auf "(?P<page>[^"]+)"$/
es: /^estoy en "(?P<page>[^"]+)"$/
nl: /^dat ik op "(?P<page>[^"]+)" ben$/
pt: /^(?:|Eu )estou em "(?P<page>[^"]+)"$/

# i-go-to-page
source: /^(?:|I )go to "(?P<page>[^"]+)"$/
cs: /^(?:|pře)jdu na(?:| stránku) "(?P<page>[^"]+)"$/
de: /^(?:|ich )gehe nach "(?P<page>[^"]+)"$/
es: /^voy a "(?P<page>[^"]+)"$/
nl: /^(?:|ik )naar "(?P<page>[^"]+)" ga$/
pt: /^(?:|Eu )Quero ir para "(?P<page>[^"]+)"$/

# reload-the-page
source: /^(?:|I )reload the page$/
cs: /^obnovím stránku$/
de: /^(?:|ich )aktualisiere die Seite$/
es: /^recargo la página$/
nl: /^(?:|ik )de pagina herlaad$/
pt: /^(?:|Eu )fiz actualizei a página$/

# move-backward-one-page
source: /^(?:|I )move backward one page$/
cs: /^(?:|pře)jdu o jednu stránku zpět$/
de: /^(?:|ich )gehe eine Seite zurück$/
es: /^voy hacia atrás una página$/
nl: /^(?:|ik )een pagina terugga$/
pt: /^(?:|Eu )retrocedi uma página$/

# move-forward-one-page
source: /^(?:|I )move forward one page$/
cs: /^(?:|pře)jdu o jednu stránku vpřed$/
de: /^(?:|ich )gehe eine Seite vorwärts$/
es: /^voy hacia adelante una página$/
nl: /^(?:|ik )een pagina vooruit ga$/
pt: /^(?:|Eu )avancei uma página$/

# i-press-button
source: /^(?:|I )press "(?P<button>(?:[^"]|\\")*)"$/
cs: /^stisknu(?:| tlačítko) "(?P<button>(?:[^"]|\\")*)"$/
de: /^(?:|ich )drücke "(?P<button>(?:[^"]|\\")*)"$/
es: /^presiono "(?P<button>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )druk op "(?P<button>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )carreguei "(?P<button>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )carrego no "(?P<button>(?:[^"]|\\")*)"$/

# i-follow-link
source: /^(?:|I )follow "(?P<link>(?:[^"]|\\")*)"$/
cs: /^kliknu na(?:| odkaz) "(?P<link>(?:[^"]|\\")*)"$/
de: /^(?:|ich )folge "(?P<link>(?:[^"]|\\")*)"$/
es: /^sigo "(?P<link>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )"(?P<link>(?:[^"]|\\")*)" volg$/
pt: /^(?:|Eu )segui "(?P<link>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )sigo "(?P<link>(?:[^"]|\\")*)"$/

# i-fill-in-field-with-value
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
cs: /^zadám do "(?P<field>(?:[^"]|\\")*)" hodnotu "(?P<value>(?:[^"]|\\")*)"$/
de: /^(?:|ich )gebe in das Feld "(?P<field>(?:[^"]|\\")*)" "(?P<value>(?:[^"]|\\")*)" ein$/
es: /^relleno "(?P<field>(?:[^"]|\\")*)" con "(?P<value>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )het veld "(?P<field>(?:[^"]|\\")*)" invul met "(?P<value>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )preenchi o "(?P<field>(?:[^"]|\\")*)" com "(?P<value>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )preencho "(?P<field>(?:[^"]|\\")*)" com "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-value-for-field
source: /^(?:|I )fill in "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
cs: /^zadám "(?P<value>(?:[^"]|\\")*)" do "(?P<field>(?:[^"]|\\")*)"$/
de: /^(?:|ich )gebe "(?P<value>(?:[^"]|\\")*)" in "(?P<field>(?:[^"]|\\")*)" ein$/
es: /^relleno con "(?P<value>(?:[^"]|\\")*)" a "(?P<field>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )de waarde "(?P<value>(?:[^"]|\\")*)" invul in "(?P<field>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )preenchi o "(?P<value>(?:[^"]|\\")*)" para "(?P<field>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )preencho "(?P<value>(?:[^"]|\\")*)" para "(?P<field>(?:[^"]|\\")*)"$/

source: /^(?:|I )fill in the following:$/
cs: /^vyplním formulář:$/
de: /^(?:|ich )gebe das folgende ein:$/
es: /^relleno lo siguiente:$/
nl: /^(?:|ik )het volgende invul:$/
pt: /^(?:|Eu )preenchi o seguinte:$/
pt_pt: /^(?:|Eu )preencho o seguinte:$/

# i-select-option-from-select
source: /^(?:|I )select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
cs: /^vyberu "(?P<option>(?:[^"]|\\")*)" z "(?P<select>(?:[^"]|\\")*)"$/
de: /^(?:|ich )wähle "(?P<option>(?:[^"]|\\")*)" von "(?P<select>(?:[^"]|\\")*)"$/
es: /^selecciono "(?P<option>(?:[^"]|\\")*)" de "(?P<select>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )de optie "(?P<option>(?:[^"]|\\")*)" selecteer voor "(?P<select>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )selecionei a "(?P<option>(?:[^"]|\\")*)" destas "(?P<select>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )seleciono a "(?P<option>(?:[^"]|\\")*)" a partir deste "(?P<select>(?:[^"]|\\")*)"$/

# i-additionally-select-option-from-select
source: /^(?:|I )additionally select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
cs: /^ještě vyberu "(?P<option>(?:[^"]|\\")*)" z "(?P<select>(?:[^"]|\\")*)"$/
de: /^(?:|ich )wähle zusätzlich "(?P<option>(?:[^"]|\\")*)" von "(?P<select>(?:[^"]|\\")*)"$/
es: /^adicionalmente selecciono "(?P<option>(?:[^"]|\\")*)" de "(?P<select>(?:[^"]|\\")*)"$/

# i-check-option
source: /^(?:|I )check "(?P<option>(?:[^"]|\\")*)"$/
cs: /^(?:zaškrtnu|označím) "(?P<option>(?:[^"]|\\")*)"$/
de: /^(?:|ich )aktiviere "(?P<option>(?:[^"]|\\")*)"$/
es: /^marco "(?P<option>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )"(?P<option>(?:[^"]|\\")*)" aanvink$/
pt: /^(?:|Eu )marquei "(?P<option>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )seleciono a "(?P<option>(?:[^"]|\\")*)"$/

# i-uncheck-option
source: /^(?:|I )uncheck "(?P<option>(?:[^"]|\\")*)"$/
cs: /^odznačím "(?P<option>(?:[^"]|\\")*)"$/
de: /^(?:|ich )deaktiviere "(?P<option>(?:[^"]|\\")*)"$/
es: /^desmarco "(?P<option>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )"(?P<option>(?:[^"]|\\")*)" uitvink$/
pt: /^(?:|Eu )não marquei "(?P<option>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )n達o selecionei a "(?P<option>(?:[^"]|\\")*)"$/

# i-attach-the-file-to-field
source: /^(?:|I )attach the file "(?P<path>[^"]*)" to "(?P<field>(?:[^"]|\\")*)"$/
cs: /^nahraji soubor "(?P<path>[^"]*)" do "(?P<field>(?:[^"]|\\")*)"$/
de: /^(?:|ich )lade die Datei "(?P<path>[^"]*)" in "(?P<field>(?:[^"]|\\")*)"$/
es: /^adjunto el archivo "(?P<path>[^"]*)" a "(?P<field>(?:[^"]|\\")*)"$/
nl: /^(?:|ik )het bestand "(?P<path>[^"]*)" toevoeg aan "(?P<field>(?:[^"]|\\")*)"$/
pt: /^(?:|Eu )anexei o ficheiro "(?P<path>[^"]*)" para "(?P<field>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )anexei o ficheio "(?P<path>[^"]*)" a "(?P<field>(?:[^"]|\\")*)"$/

# i-should-see-text
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)"$/
cs: /^musím vidět(?:| text) "(?P<text>(?:[^"]|\\")*)"$/
de: /^(?:|ich )sollte "(?P<text>(?:[^"]|\\")*)" sehen$/
es: /^debo ver "(?P<text>(?:[^"]|\\")*)"$/
nl: /^moet (?:|ik )"(?P<text>(?:[^"]|\\")*)" zien$/
pt: /^(?:|Eu )deveria ver "(?P<text>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )devo ver "(?P<text>(?:[^"]|\\")*)"$/

# the-response-should-contain
source: /^the response should contain "(?P<text>(?:[^"]|\\")*)"$/
cs: /^stránka musí obsahovat "(?P<text>(?:[^"]|\\")*)"$/
de: /^die Rückmeldung sollte "(?P<text>(?:[^"]|\\")*)" enthalten$/
es: /^la respuesta debe contener "(?P<text>(?:[^"]|\\")*)"$/
nl: /^moet het antwoord "(?P<text>(?:[^"]|\\")*)" bevatten$/
pt: /^A resposta devia de conter "(?P<text>(?:[^"]|\\")*)"$/

# i-should-not-see-text
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)"$/
cs: /^nesmím vidět(?:| text) "(?P<text>(?:[^"]|\\")*)"$/
de: /^(?:|ich )sollte nicht "(?P<text>(?:[^"]|\\")*)" sehen$/
es: /^no debo ver "(?P<text>(?:[^"]|\\")*)"$/
nl: /^moet (?:|ik )niet "(?P<text>(?:[^"]|\\")*)" zien$/
pt: /^(?:|Eu )não deveria de ver "(?P<text>(?:[^"]|\\")*)"$/
pt_pt: /^(?:|Eu )n達o devo ver "(?P<text>(?:[^"]|\\")*)"$/

# the-response-should-not-contain
source: /^the response should not contain "(?P<text>(?:[^"]|\\")*)"$/
cs: /^stránka nesmí obsahovat "(?P<text>(?:[^"]|\\")*)"$/
de: /^die Rückmeldung sollte nicht "(?P<text>(?:[^"]|\\")*)" enthalten$/
es: /^la respuesta no debe contener "(?P<text>(?:[^"]|\\")*)"$/
nl: /^moet het antwoord "(?P<text>(?:[^"]|\\")*)" niet bevatten$/
pt: /^A resposta não deveria de conter "(?P<text>(?:[^"]|\\")*)"$/

# the-field-should-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should contain "(?P<value>(?:[^"]|\\")*)"$/
cs: /^pole "(?P<field>(?:[^"]|\\")*)" musí obsahovat "(?P<value>(?:[^"]|\\")*)"$/
de: /^das "(?P<field>(?:[^"]|\\")*)" Feld sollte "(?P<value>(?:[^"]|\\")*)" enthalten$/
es: /^el campo "(?P<field>(?:[^"]|\\")*)" debe contener "(?P<value>(?:[^"]|\\")*)"$/
nl: /^moet "(?P<field>(?:[^"]|\\")*)" "(?P<value>(?:[^"]|\\")*)" bevatten$/
pt: /^O campo "(?P<field>(?:[^"]|\\")*)" deveria conter "(?P<value>(?:[^"]|\\")*)"$/
pt_pt: /^O campo "(?P<field>(?:[^"]|\\")*)" deve conter "(?P<value>(?:[^"]|\\")*)"$/

# the-field-should-not-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should not contain "(?P<value>(?:[^"]|\\")*)"$/
cs: /^pole "(?P<field>(?:[^"]|\\")*)" nesmí obsahovat "(?P<value>(?:[^"]|\\")*)"$/
de: /^das "(?P<field>(?:[^"]|\\")*)" Feld sollte nicht "(?P<value>(?:[^"]|\\")*)" enthalten$/
es: /^el campo "(?P<field>(?:[^"]|\\")*)" no debe contener "(?P<value>(?:[^"]|\\")*)"$/
nl: /^moet "(?P<field>(?:[^"]|\\")*)" "(?P<value>(?:[^"]|\\")*)" niet bevatten$/
pt: /^O campo "(?P<field>(?:[^"]|\\")*)" não deveria de conter "(?P<value>(?:[^"]|\\")*)"$/
pt_pt: /^O campo "(?P<field>(?:[^"]|\\")*)" n達o deve conter "(?P<value>(?:[^"]|\\")*)"$/

# the-checkbox-should-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should be checked$/
cs: /^pole "(?P<checkbox>(?:[^"]|\\")*)" musí být (?:zaškrtnuto|vybráno|označeno)$/
de: /^die "(?P<checkbox>(?:[^"]|\\")*)" checkbox sollte aktiviert sein$/
es: /^la casilla de selección "(?P<checkbox>[^"]*) debe estar marcada" $/
nl: /^moet "(?P<checkbox>(?:[^"]|\\")*)" aangevinkt zijn$/
pt: /^A checkbox "(?P<checkbox>(?:[^"]|\\")*)" tem de estar marcada$/
pt_pt: /^A checkbox "(?P<checkbox>[^"]*) deve estar selecionada" $/

# the-checkbox-should-not-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should not be checked$/
cs: /^pole "(?P<checkbox>(?:[^"]|\\")*)" nesmí být (?:zaškrtnuto|vybráno|označeno)$/
de: /^die "(?P<checkbox>(?:[^"]|\\")*)" checkbox sollte nicht aktiviert sein$/
es: /^la casilla de selección "(?P<checkbox>(?:[^"]|\\")*)" no debe estar marcada$/
nl: /^moet "(?P<checkbox>(?:[^"]|\\")*)" niet aangevinkt zijn$/
pt: /^A checkbox "(?P<checkbox>(?:[^"]|\\")*)" não deveria estar marcada$/
pt_pt: /^A checkbox "(?P<checkbox>(?:[^"]|\\")*)" n達o deve estar selecionada$/

# i-should-be-on-page
source: /^(?:|I )should be on "(?P<page>[^"]+)"$/
cs: /^musím být na stránce "(?P<page>[^"]+)"$/
de: /^(?:|ich )sollte auf "(?P<page>[^"]+) sein"$/
es: /^debo estar en "(?P<page>[^"]+)"$/
nl: /^moet (?:|ik )op "(?P<page>[^"]+)" zijn$/
pt: /^(?:|Eu )deveria estar em "(?P<page>[^"]+)"$/

# the-url-should-match
source: /^the url should match "(?P<pattern>(?:[^"]|\\")*)"$/
cs: /^(?:url|adresa|url adresa) musí mít tvar "(?P<pattern>(?:[^"]|\\")*)"$/
de: /^die Webadresse sollte mit "(?P<pattern>(?:[^"]|\\")*)" übereinstimmen$/
es: /^la URL debe seguir el patrón "(?P<pattern>(?:[^"]|\\")*)"$/
nl: /^moet de url overeenkomen met "(?P<pattern>(?:[^"]|\\")*)"$/
pt: /^O endereço deveria coincidir com "(?P<pattern>(?:[^"]|\\")*)"$/

# the-element-should-contain
source: /^the "(?P<element>[^"]*)" element should contain "(?P<value>(?:[^"]|\\")*)"$/
cs: /^element "(?P<element>[^"]*)" musí obsahovat "(?P<value>(?:[^"]|\\")*)"$/
de: /^das "(?P<element>[^"]*)" Element sollte "(?P<value>(?:[^"]|\\")*)" enthalten$/
es: /^el elemento "(?P<element>[^"]*)" debe contener "(?P<value>(?:[^"]|\\")*)"$/
nl: /^moet het element "(?P<element>[^"]*)" "(?P<value>(?:[^"]|\\")*)" bevatten$/
pt: /^O elemento "(?P<element>[^"]*)" deveria conter "(?P<value>(?:[^"]|\\")*)"$/

# i-should-see-text-in-element
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
cs: /^musím vidět(?:| text) "(?P<text>(?:[^"]|\\")*)" uvnitř elementu "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte "(?P<text>(?:[^"]|\\")*)" im "(?P<element>[^"]*)" Element sehen$/
es: /^debo ver "(?P<text>(?:[^"]|\\")*)" en el elemento "(?P<element>[^"]*)"$/
nl: /^moet (?:|ik )"(?P<text>(?:[^"]|\\")*)" zien in "(?P<element>[^"]*)"$/
pt: /^(?:|Eu )deveria ver "(?P<text>(?:[^"]|\\")*)" no elemento "(?P<element>[^"]*)"$/

# i-should-see-element
source: /^(?:|I )should see an? "(?P<element>[^"]*)" element$/
cs: /^musím vidět element "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte ein "(?P<element>[^"]*)" Element sehen$/
es: /^debo ver un elemento "(?P<element>[^"]*)"$/
nl: /^moet (?:|ik )een element "(?P<element>[^"]*)" zien$/
pt: /^(?:|Eu )deveria ver um? "(?P<element>[^"]*)"$/

# i-should-not-see-element
source: /^(?:|I )should not see an? "(?P<element>[^"]*)" element$/
cs: /^nesmím vidět element "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte kein "(?P<element>[^"]*)" Element sehen$/
es: /^no debo ver un elemento "(?P<element>[^"]*)"$/
nl: /^moet (?:|ik )een element "(?P<element>[^"]*)" niet zien$/
pt: /^(?:|Eu )não deveria ver um? "(?P<element>[^"]*)"$/

# i-should-see-num-elements
source: /^(?:|I )should see (?P<num>\d+) "(?P<element>[^"]*)" elements?$/
cs: /^musím vidět (?P<num>\d+) element(?:|y|ů) "(?P<element>[^"]*)"$/
de: /^(?:|ich )sollte (?P<num>\d+) "(?P<element>[^"]*)" Elemente? sehen$/
es: /^debo ver (?P<num>\d+) "(?P<element>[^"]*)" elementos$/

# the-response-status-code-should-be
source: /^the response status code should be (?P<code>\d+)$/
cs: /^(?:|stavový )kód odpovědi serveru musí být (?P<code>\d+)$/
de: /^die Status-Code-Rückmeldung sollte (?P<code>\d+) sein$/
es: /^el código de estado de la respuesta debe ser (?P<code>\d+)$/
nl: /^moet de statuscode van het antwoord (?P<code>\d+) zijn$/
pt: /^O estado da resposta deveria ser (?P<code>\d+)$/

# the-response-status-code-should-not-be
source: /^the response status code should not be (?P<code>\d+)$/
cs: /^(?:|stavový )kód odpovědi serveru nesmí být (?P<code>\d+)$/
de: /^die Status-Code-Rückmeldung sollte nicht (?P<code>\d+) sein$/
es: /^el código de estado de la respuesta no debe ser (?P<code>\d+)$/

source: /^print last response$/
cs: /^vypiš (?:|poslední )stránku$/
de: /^gib die letzte Rückmeldung aus$/
es: /^imprime la última respuesta$/
nl: /^print het laatste antwoord$/
pt: /^Imprimir a última resposta$/

source: /^show last response$/
cs: /^zobraz (?:|poslední )stránku$/
de: /^zeige die letzte Rückmeldung$/
es: /^muestra la última respuesta$/
nl: /^toon het laatste antwoord$/
pt: /^Mostrar a última resposta$/

# i-am-on-page
source: /^(?:|I )am on (?P<page>.+)$/
pt_pt: /^(?:|Eu )estar em (?P<page>.+)$/

# i-go-to-page
source: /^(?:|I )go to (?P<page>.+)$/
pt_pt: /^(?:|Eu )vou para (?P<page>.+)$/

# i-should-be-on-page
source: /^(?:|I )should be on (?P<page>.+)$/
pt_pt: /^(?:|Eu )devo estar em (?P<page>.+)$/
