Repository: minkphp/Mink
Catalog: i18n/*.xliff
Languages: fr, it, pl, sv

# i-am-on-page
source: /^(?:|I )am on "(?P<page>[^"]+)"$/
fr: /^(?:|je )suis sur "(?P<page>[^"]+)"$/
it: /^(?:|io )sono sulla pagina "(?P<page>[^"]+)"$/
pl: /^(?:|że )jestem na stronie "(?P<page>[^"]+)"$/
sv: /^(?:|jag )är på "(?P<page>[^"]+)"$/

# i-go-to-page
source: /^(?:|I )go to "(?P<page>[^"]+)"$/
fr: /^(?:|je )vais sur "(?P<page>[^"]+)"$/
it: /^(?:|io )vado alla pagina "(?P<page>[^"]+)"$/
pl: /^(?:|że )odwiedzę stronę "(?P<page>[^"]+)"$/
sv: /^(?:|jag )gå till "(?P<page>[^"]+)"$/

# reload-the-page
source: /^(?:|I )reload the page$/
fr: /^(?:|je )recharge la page$/
it: /^(?:|io )ricarico la pagina$/
pl: /^(?:|że )odświeżę stronę$/
sv: /^(?:|jag )ladda om sidan$/

# move-backward-one-page
source: /^(?:|I )move backward one page$/
fr: /^(?:|je )recule d'une page$/
it: /^(?:|io )torno alla pagina precedente$/
pl: /^(?:|że )cofnę się do poprzedniej strony$/
sv: /^(?:|jag )gå tillbaka en sida$/

# move-forward-one-page
source: /^(?:|I )move forward one page$/
fr: /^(?:|j')avance d'une page$/
it: /^(?:|io )avanzo di una pagina$/
pl: /^(?:|że )przejdę na kolejną stronę$/
sv: /^(?:|jag )gå en sida framåt$/

# i-press-button
source: /^(?:|I )press "(?P<button>(?:[^"]|\\")*)"$/
fr: /^(?:|je )presse "(?P<button>(?:[^"]|\\")*)"$/
it: /^(?:|io )premo "(?P<button>(?:[^"]|\\")*)"$/
pl: /^(?:|że )nacisnę przycisk "(?P<button>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )trycka "(?P<button>(?:[^"]|\\")*)"$/

# i-follow-link
source: /^(?:|I )follow "(?P<link>(?:[^"]|\\")*)"$/
fr: /^(?:|je )suis "(?P<link>(?:[^"]|\\")*)"$/
it: /^(?:|io )clicco sul link "(?P<link>(?:[^"]|\\")*)"$/
pl: /^(?:|że )kliknę na link "(?P<link>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )följa "(?P<link>(?:[^"]|\\")*)"$/

# i-fill-in-field-with-value
source: /^(?:|I )fill in "(?P<field>(?:[^"]|\\")*)" with "(?P<value>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis "(?P<field>(?:[^"]|\\")*)" avec "(?P<value>(?:[^"]|\\")*)"$/
it: /^(?:|io )compilo il campo "(?P<field>(?:[^"]|\\")*)" con "(?P<value>(?:[^"]|\\")*)"$/
pl: /^(?:|że )wypełnię pole "(?P<field>(?:[^"]|\\")*)" wartością "(?P<value>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )fylla in "(?P<field>(?:[^"]|\\")*)" med "(?P<value>(?:[^"]|\\")*)"$/

# i-fill-in-value-for-field
source: /^(?:|I )fill in "(?P<value>(?:[^"]|\\")*)" for "(?P<field>(?:[^"]|\\")*)"$/
fr: /^(?:|je )remplis "(?P<value>(?:[^"]|\\")*)" pour "(?P<field>(?:[^"]|\\")*)"$/
it: /^(?:|io )inserisco il valore "(?P<value>(?:[^"]|\\")*)" per il campo "(?P<field>(?:[^"]|\\")*)"$/
pl: /^(?:|że )wpiszę "(?P<value>(?:[^"]|\\")*)" w polu "(?P<field>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )fylla in "(?P<value>(?:[^"]|\\")*)" för "(?P<field>(?:[^"]|\\")*)"$/

source: /^(?:|I )fill in the following:$/
fr: /^(?:|je )remplis le texte suivant:$/
it: /^(?:|io )compilo con:$/
pl: /^(?:|że )wypełnię następujące pola:$/
sv: /^(?:|jag )fylla in följande:$/

# i-select-option-from-select
source: /^(?:|I )select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
fr: /^(?:|je )sélectionne "(?P<option>(?:[^"]|\\")*)" depuis "(?P<select>(?:[^"]|\\")*)"$/
it: /^(?:|io )seleziono "(?P<option>(?:[^"]|\\")*)" da "(?P<select>(?:[^"]|\\")*)"$/
pl: /^(?:|że )wybiorę opcję "(?P<option>(?:[^"]|\\")*)" w polu "(?P<select>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )välja "(?P<option>(?:[^"]|\\")*)" från "(?P<select>(?:[^"]|\\")*)"$/

# i-additionally-select-option-from-select
source: /^(?:|I )additionally select "(?P<option>(?:[^"]|\\")*)" from "(?P<select>(?:[^"]|\\")*)"$/
fr: /^(?:|je )sélectionne une autre option "(?P<option>(?:[^"]|\\")*)" depuis "(?P<select>(?:[^"]|\\")*)"$/
it: /^(?:|io )seleziono anche "(?P<option>(?:[^"]|\\")*)" da "(?P<select>(?:[^"]|\\")*)"$/
pl: /^(?:|że )dodatkowo zaznaczę opcję "(?P<option>(?:[^"]|\\")*)" w polu "(?P<select>(?:[^"]|\\")*)"$/

# i-check-option
source: /^(?:|I )check "(?P<option>(?:[^"]|\\")*)"$/
fr: /^(?:|je )coche "(?P<option>(?:[^"]|\\")*)"$/
it: /^(?:|io )metto la spunta a "(?P<option>(?:[^"]|\\")*)"$/
pl: /^(?:|że )zaznaczę opcję "(?P<option>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )markera "(?P<option>(?:[^"]|\\")*)"$/

# i-uncheck-option
source: /^(?:|I )uncheck "(?P<option>(?:[^"]|\\")*)"$/
fr: /^(?:|je )décoche "(?P<option>(?:[^"]|\\")*)"$/
it: /^(?:|io )rimuovo la spunta da "(?P<option>(?:[^"]|\\")*)"$/
pl: /^(?:|że )odznaczę opcję "(?P<option>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )avmarkera "(?P<option>(?:[^"]|\\")*)"$/

# i-attach-the-file-to-field
source: /^(?:|I )attach the file "(?P<path>[^"]*)" to "(?P<field>(?:[^"]|\\")*)"$/
fr: /^(?:|j' )attache le fichier "(?P<path>[^"]*)" à "(?P<field>(?:[^"]|\\")*)"$/
it: /^(?:|io )aggiungo il file "(?P<path>[^"]*)" a "(?P<field>(?:[^"]|\\")*)"$/
pl: /^(?:|że )załączę plik "(?P<path>[^"]*)" w polu "(?P<field>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )bifoga filen "(?P<path>[^"]*)" till "(?P<field>(?:[^"]|\\")*)"$/

# i-should-see-text
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)"$/
fr: /^(?:|je )devrais voir "(?P<text>(?:[^"]|\\")*)"$/
it: /^(?:|io )dovrei vedere "(?P<text>(?:[^"]|\\")*)"$/
pl: /^(?:|że )zobaczę tekst "(?P<text>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )skulle se "(?P<text>(?:[^"]|\\")*)"$/

# the-response-should-contain
source: /^the response should contain "(?P<text>(?:[^"]|\\")*)"$/
fr: /^la réponse devrait contenir "(?P<text>(?:[^"]|\\")*)"$/
it: /^la risposta dovrebbe contenere "(?P<text>(?:[^"]|\\")*)"$/
pl: /^odpowiedź powinna zawierać tekst "(?P<text>(?:[^"]|\\")*)"$/
sv: /^responsen skulle innehålla "(?P<text>(?:[^"]|\\")*)"$/

# i-should-not-see-text
source: /^(?:|I )should not see "(?P<text>(?:[^"]|\\")*)"$/
fr: /^(?:|je )ne devrais pas voir "(?P<text>(?:[^"]|\\")*)"$/
it: /^(?:|io )non dovrei vedere "(?P<text>(?:[^"]|\\")*)"$/
pl: /^(?:|że )nie zobaczę tekstu "(?P<text>(?:[^"]|\\")*)"$/
sv: /^(?:|jag )skulle inte se "(?P<text>(?:[^"]|\\")*)"$/

# the-response-should-not-contain
source: /^the response should not contain "(?P<text>(?:[^"]|\\")*)"$/
fr: /^la réponse ne devrait pas contenir "(?P<text>(?:[^"]|\\")*)"$/
it: /^la risposta non dovrebbe contenere "(?P<text>(?:[^"]|\\")*)"$/
pl: /^odpowiedź nie powinna zawierać tekstu "(?P<text>(?:[^"]|\\")*)"$/
sv: /^responsen skulle inte innehålla "(?P<text>(?:[^"]|\\")*)"$/

# the-field-should-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should contain "(?P<value>(?:[^"]|\\")*)"$/
fr: /^le champ "(?P<field>(?:[^"]|\\")*)" devrait contenir "(?P<value>(?:[^"]|\\")*)"$/
it: /^il campo "(?P<field>(?:[^"]|\\")*)" dovrebbe contenere "(?P<value>(?:[^"]|\\")*)"$/
pl: /^pole "(?P<field>(?:[^"]|\\")*)" powinno zawierać wartość "(?P<value>(?:[^"]|\\")*)"$/
sv: /^fältet "(?P<field>(?:[^"]|\\")*)" skulle inehålla "(?P<value>(?:[^"]|\\")*)"$/

# the-field-should-not-contain-value
source: /^the "(?P<field>(?:[^"]|\\")*)" field should not contain "(?P<value>(?:[^"]|\\")*)"$/
fr: /^le champ "(?P<field>(?:[^"]|\\")*)" ne devrait pas contenir "(?P<value>(?:[^"]|\\")*)"$/
it: /^il campo "(?P<field>(?:[^"]|\\")*)" non dovrebbe contenere "(?P<value>(?:[^"]|\\")*)"$/
pl: /^pole "(?P<field>(?:[^"]|\\")*)" nie powinno zawierać wartości "(?P<value>(?:[^"]|\\")*)"$/
sv: /^fältet "(?P<field>(?:[^"]|\\")*)" skulle inte innehålla "(?P<value>(?:[^"]|\\")*)"$/

# the-checkbox-should-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should be checked$/
fr: /^la case à cocher "(?P<checkbox>[^"]*)" devrait être cochée$/
it: /^l'opzione "(?P<checkbox>[^"]*)" dovrebbe essere spuntata$/
pl: /^pole "(?P<checkbox>(?:[^"]|\\")*)" jest zaznaczone$/
sv: /^kryssrutan "(?P<checkbox>(?:[^"]|\\")*)" skulle vara markerat$/

# the-checkbox-should-not-be-checked
source: /^the "(?P<checkbox>(?:[^"]|\\")*)" checkbox should not be checked$/
fr: /^la case à cocher "(?P<checkbox>(?:[^"]|\\")*)" ne devrait pas être cochée$/
it: /^l'opzione "(?P<checkbox>(?:[^"]|\\")*)" non dovrebbe essere spuntata$/
pl: /^pole "(?P<checkbox>(?:[^"]|\\")*)" jest odznaczone$/
sv: /^kryssrutan "(?P<checkbox>(?:[^"]|\\")*)" skulle inte vara markerat$/

# i-should-be-on-page
source: /^(?:|I )should be on "(?P<page>[^"]+)"$/
fr: /^(?:|je )devrais être sur "(?P<page>[^"]+)"$/
it: /^(?:|io )dovrei essere sulla pagina "(?P<page>[^"]+)"$/
pl: /^(?:|że )powinienem być na stronie "(?P<page>[^"]+)"$/
sv: /^(?:|jag )skulle vara på "(?P<page>[^"]+)"$/

# the-url-should-match
source: /^the url should match "(?P<pattern>(?:[^"]|\\")*)"$/
fr: /^l'url devrait suivre le motif "(?P<pattern>(?:[^"]|\\")*)"$/
it: /^l'url dovrebbe essere "(?P<pattern>(?:[^"]|\\")*)"$/
sv: /^webbadressen skulle matcha "(?P<pattern>(?:[^"]|\\")*)"$/

# the-element-should-contain
source: /^the "(?P<element>[^"]*)" element should contain "(?P<value>(?:[^"]|\\")*)"$/
fr: /^l'élément "(?P<element>[^"]*)" devrait contenir "(?P<value>(?:[^"]|\\")*)"$/
it: /^l'elemento "(?P<element>[^"]*)" dovrebbe contenere "(?P<value>(?:[^"]|\\")*)"$/
pl: /^element "(?P<element>[^"]*)" powinien zawierać "(?P<value>(?:[^"]|\\")*)"$/
sv: /^elementen "(?P<element>[^"]*)" skulle innehålla "(?P<value>(?:[^"]|\\")*)"$/

# i-should-see-text-in-element
source: /^(?:|I )should see "(?P<text>(?:[^"]|\\")*)" in the "(?P<element>[^"]*)" element$/
fr: /^(?:|je )devrais voir "(?P<text>(?:[^"]|\\")*)" dans l'élément "(?P<element>[^"]*)"$/
it: /^(?:|io )dovrei vedere "(?P<text>(?:[^"]|\\")*)" nell'elemento "(?P<element>[^"]*)"$/
pl: /^(?:|że )powinienem widzieć "(?P<text>(?:[^"]|\\")*)" wewnątrz elementu "(?P<element>[^"]*)"$/
sv: /^(?:|jag )skulle se "(?P<text>(?:[^"]|\\")*)" i "(?P<element>[^"]*)" elementet$/

# i-should-see-element
source: /^(?:|I )should see an? "(?P<element>[^"]*)" element$/
fr: /^(?:|je )devrais voir l'élément "(?P<element>[^"]*)"$/
it: /^(?:|io )dovrei vedere l'elemento? "(?P<element>[^"]*)"$/
pl: /^(?:|że )powinienem widzieć element "(?P<element>[^"]*)"$/
sv: /^(?:|jag )skulle se ett "(?P<element>[^"]*)" element$/

# i-should-not-see-element
source: /^(?:|I )should not see an? "(?P<element>[^"]*)" element$/
fr: /^(?:|je )ne devrais pas voir l'élément "(?P<element>[^"]*)"$/
it: /^(?:|io )non dovrei vedere l'elemento? "(?P<element>[^"]*)"$/
pl: /^(?:|że )nie powinienem widzieć elementu "(?P<element>[^"]*)"$/
sv: /^(?:|jag )skulle inte se ett "(?P<element>[^"]*)" element$/

# i-should-see-num-elements
source: /^(?:|I )should see (?P<num>\d+) "(?P<element>[^"]*)" elements?$/
fr: /^(?:|je )devrais voir (?P<num>\d+) éléments? "(?P<element>[^"]*)"$/
it: /^(?:|io )dovrei vedere (?P<num>\d+) elementi? "(?P<element>[^"]*)"$/
pl: /^(?:|że )powinienem widzieć (?P<num>\d+) element(y|ów)? "(?P<element>[^"]*)"$/

# the-response-status-code-should-be
source: /^the response status code should be (?P<code>\d+)$/
fr: /^le code de status de la réponse devrait être (?P<code>\d+)$/
it: /^il codice di risposta dovrebbe essere (?P<code>\d+)$/
pl: /^kod statusu odpowiedzi powinien być równy (?P<code>\d+)$/
sv: /^status code responsen skulle vara (?P<code>\d+)$/

# the-response-status-code-should-not-be
source: /^the response status code should not be (?P<code>\d+)$/
fr: /^le code de status de la réponse ne devrait pas être (?P<code>\d+)$/
it: /^il codice di risposta non dovrebbe essere (?P<code>\d+)$/
pl: /^kod statusu odpowiedzi nie powinien być równy (?P<code>\d+)$/

source: /^print last response$/
fr: /^imprimer la dernière réponse$/
it: /^stampa l'ultima risposta$/
pl: /^wypisz ostatnią odpowiedź$/
sv: /^skriva ut sista respons$/

source: /^show last response$/
fr: /^montrer la dernière réponse$/
it: /^mostra l'ultima risposta$/
pl: /^pokaż ostatnią odpowiedź$/
sv: /^visa sista respons$/

# the-url-should-match
source: /^the (?i)url(?-i) should match "(?P<pattern>(?:[^"]|\\")*)"$/
pl: /^(?:url|adres) powinien odpowiadać "(?P<pattern>(?:[^"]|\\")*)"$/
