Repository: minkphp/Mink
Catalog: src/Behat/Mink/Integration/steps/i18n/*.xliff
Languages: ja, ru

# i-am-on-page
source: /^(?:|I )am on (?P<page>.+)$/
ja: /^(?:|ユーザーは )(?P<page>[^\s]+) を表示している$/
ru: /^(?:|я )на странице (?P<page>.+)$/

# i-go-to-page
source: /^(?:|I )go to (?P<page>.+)$/
ja: /^(?:|ユーザーが )(?P<page>[^\s]+) へ移動する$/
ru: /^(?:|я )перехожу на (?P<page>.+)$/

# i-press-button
source: /^(?:|I )press "(?P<button>[^"]*)"$/
ja: /^(?:|ユーザーが )"(?P<button>[^"]*)" ボタンをクリックする$/
ru: /^(?:|я )нажимаю "(?P<button>[^"]*)"$/

# i-follow-link
source: /^(?:|I )follow "(?P<link>[^"]*)"$/
ja: /^(?:|ユーザーが )"(?P<link>[^"]*)" のリンク先へ移動する$/
ru: /^(?:|я )кликаю по ссылке "(?P<link>[^"]*)"$/

# i-fill-in-field-with-value
source: /^(?:|I )fill in "(?P<field>[^"]*)" with "(?P<value>[^"]*)"$/
ja: /^(?:|ユーザーが )"(?P<field>[^"]*)" フィールドに "(?P<value>[^"]*)" と入力する$/
ru: /^(?:|я )заполняю поле "(?P<field>[^"]*)" значением "(?P<value>[^"]*)"$/

# i-fill-in-value-for-field
source: /^(?:|I )fill in "(?P<value>[^"]*)" for "(?P<field>[^"]*)"$/
ja: /^(?:|ユーザーが )"(?P<value>[^"]*)" という値を "(?P<field>[^"]*)" に入力する$/
ru: /^(?:|я )ввожу "(?P<value>[^"]*)" в поле "(?P<field>[^"]*)"$/

source: /^(?:|I )fill in the following:$/
ja: /^(?:|ユーザーが)次のように入力する:$/
ru: /^(?:|я )ввожу следующие значения:$/

# i-select-option-from-select
source: /^(?:|I )select "(?P<option>[^"]*)" from "(?P<select>[^"]*)"$/
ja: /^(?:|ユーザーが )"(?P<option>[^"]*)" という値を "(?P<select>[^"]*)" から選択する$/
ru: /^(?:|я )выбираю "(?P<option>[^"]*)" в поле "(?P<select>[^"]*)"$/

# i-check-option
source: /^(?:|I )check "(?P<option>[^"]*)"$/
ja: /^(?:|ユーザーが )"(?P<option>[^"]*)" にチェックをつける$/
ru: /^(?:|я )ставлю галочку "(?P<option>[^"]*)"$/

# i-uncheck-option
source: /^(?:|I )uncheck "(?P<option>[^"]*)"$/
ja: /^(?:|ユーザーが )"(?P<option>[^"]*)" のチェックをはずす$/
ru: /^(?:|я )снимаю галочку "(?P<option>[^"]*)"$/

# i-attach-the-file-to-field
source: /^(?:|I )attach the file "(?P<path>[^"]*)" to "(?P<field>[^"]*)"$/
ja: /^(?:|ユーザーが)パス "(?P<path>[^"]*)" にあるファイルを "(?P<field>[^"]*)" に添付する$/
ru: /^(?:|я )выбираю файл "(?P<path>[^"]*)" в поле "(?P<field>[^"]*)"$/

# i-should-see-text
source: /^(?:|I )should see "(?P<text>[^"]*)"$/
ja: /^(?:|画面に )"(?P<text>[^"]*)" と表示されていること$/

# i-should-not-see-text
source: /^(?:|I )should not see "(?P<text>[^"]*)"$/
ja: /^(?:|画面に )"(?P<text>[^"]*)" と表示されていないこと$/

# the-field-should-contain-value
source: /^the "(?P<field>[^"]*)" field should contain "(?P<value>[^"]*)"$/
ja: /^"(?P<field>[^"]*)" フィールドに "(?P<value>[^"]*)" が含まれていること$/
ru: /^поле "(?P<field>[^"]*)" должно содержать "(?P<value>[^"]*)"$/

# the-field-should-not-contain-value
source: /^the "(?P<field>[^"]*)" field should not contain "(?P<value>[^"]*)"$/
ja: /^"(?P<field>[^"]*)" フィールドに "(?P<value>[^"]*)" が含まれていないこと$/
ru: /^поле "(?P<field>[^"]*)" не должно содержать "(?P<value>[^"]*)"$/

# the-checkbox-should-be-checked
source: /^the "(?P<checkbox>[^"]*)" checkbox should be checked$/
ja: /^チェックボックス "(?P<checkbox>[^"]*)" のチェックがついていること$/
ru: /^галочка "(?P<checkbox>[^"]*)" должна быть отмечена$/

# the-checkbox-should-not-be-checked
source: /^the "(?P<checkbox>[^"]*)" checkbox should not be checked$/
ja: /^チェックボックス "(?P<checkbox>[^"]*)" のチェックがはずれていること$/
ru: /^галочка "(?P<checkbox>[^"]*)" не должна быть отмечена$/

# i-should-be-on-page
source: /^(?:|I )should be on (?P<page>.+)$/
ja: /^(?:|ユーザーが )(?P<page>[^\s]+) を表示していること$/
ru: /^(?:|я )должен быть на странице (?P<page>.+)$/

# element-should-contain
source: /^the "(?P<element>[^"]*)" element should contain "(?P<value>[^"]*)"$/
ja: /^"(?P<element>[^"]*)" エレメントに "(?P<value>[^"]*)" という値が含まれていること$/

# should-see-element
source: /^(?:|I )should see "(?P<element>[^"]*)" element$/
ja: /^(?:|画面に )"(?P<element>[^"]*)" エレメントが表示されていること$/

# should-not-see-element
source: /^(?:|I )should not see "(?P<element>[^"]*)" element$/
ja: /^(?:|画面に )"(?P<element>[^"]*)" エレメントが表示されていないこと$/

# element-should-link-to
source: /^the "(?P<element>[^"]*)" element should link to (?P<href>.*)$/
ja: /^"(?P<element>[^"]*)" エレメントが (?P<href>.*) へリンクされていること$/

# element-should-have-attribute
source: /^the "(?P<element>[^"]*)" element should have a "(?P<attribute>[a-zA-Z\-\_]*)" attribute of "(?P<value>[^"]*)"$/
ja: /^"(?P<element>[^"]*)" エレメントに "(?P<attribute>[a-zA-Z\-\_]*)" 属性があり、値が "(?P<value>[^"]*)" であること$/

# response-status-code-should-be
source: /the response status code should be (?P<code>\d+)/
ja: /レスポンスコードが (?P<code>\d+) であること/

# i-should-see-text
source: /^(?:|I )should see "(?P<text>[^"]*+)"$/
ru: /^(?:|я )должен видеть "(?P<text>[^"]*+)"$/

# i-should-not-see-text
source: /^(?:|I )should not see "(?P<text>[^"]*+)"$/
ru: /^(?:|я )не должен видеть "(?P<text>[^"]*+)"$/

# the-element-should-contain
source: /^the "(?P<element>[^"]*)" element should contain "(?P<value>[^"]*)"$/
ru: /^элемент "(?P<element>[^"]*)" должен содержать "(?P<value>[^"]*)"$/

# i-should-see-element
source: /^(?:|I )should see "(?P<element>[^"]*)" element$/
ru: /^(?:|Я )должен видеть элемент "(?P<element>[^"]*)"$/

# i-should-not-see-element
source: /^(?:|I )should not see "(?P<element>[^"]*)" element$/
ru: /^(?:|Я )не должен видеть элемент "(?P<element>[^"]*)"$/

# the-element-should-link-to
source: /^the "(?P<element>[^"]*)" element should link to (?P<href>.*)$/
ru: /^элемент "(?P<element>[^"]*)" должен вести на страницу (?P<href>.*)$/

# the-element-should-have-attribute-of
source: /^the "(?P<element>[^"]*)" element should have a "(?P<attribute>[a-zA-Z\-\_]*)" attribute of "(?P<value>[^"]*)"$/
ru: /^элемент "(?P<element>[^"]*)" должен иметь аттрибут "(?P<attribute>[a-zA-Z\-\_]*)", содержащий "(?P<value>[^"]*)"$/

source: /the response status code should be (?P<code>\d+)/
ru: /код ответа сервера должен быть (?P<code>\d+)/
